АлогистикТест2/src/Documents/алк_РучноеИзменениеПараметровПакета/алк_РучноеИзменениеПараметровПакета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РучноеИзменениеПараметровПакета</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСостав1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика1</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат1</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница1</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка1</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит1</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭО1</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сухой1</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Припуск1</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ПакетыВСушильныхКамерах/алк_ПакетыВСушильныхКамерах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПакетыВСушильныхКамерах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_СушильныеКамеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_БоковаяДоска/алк_БоковаяДоска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_БоковаяДоска</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПлотностьНоменклатуры/алк_ПлотностьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПлотностьНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлотностьКгМ3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТарыКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВесПоддона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_РучноеИзменениеПараметровПакета/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборХарактеристикиПоКатегорииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерПриИзменении(Элемент)
	СерийныйНомерПриИзмененииНаСервере();
	УстановитьОтборХарактеристикиПоКатегорииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборХарактеристикиПоКатегорииНоменклатуры()

	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Объект.КатегорияНоменклатуры);
	НовыйМассив.Добавить(РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Объект.КатегорияНоменклатуры));
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", НовыеЗначения);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Характеристика1.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры


&НаСервере
Процедура СерийныйНомерПриИзмененииНаСервере()
	
	ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(Объект.СерийныйНомер);
	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыПакета);
	
	Объект.КатегорияНоменклатуры = ПараметрыПакета.КатегорияНоменклатуры;
	
	Если ПараметрыПакета.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.ПиломатериалСП Тогда 
		СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс 		
		// проверка на нахождение пакета в сушильной камере для установки ячейчи  		
		Ячейка = ПолучитьЯчейкуСушильногоПакета();                                	
	Иначе 	
		СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад; // Склад готовой продукции  		
		Ячейка = Справочники.Ячейки.ПустаяСсылка();	                                                        	
	КонецЕсли;

	Объект.Объем1 						= Объект.Объем;   
	Объект.ОбъемТаможня1				= Объект.ОбъемТаможня;
	Объект.ВесБруттоТаможня1 			= Объект.ВесБруттоТаможня;
	Объект.ВесНеттоТаможня1				= Объект.ВесНеттоТаможня;
	Объект.СертификатFSC1 				= Объект.СертификатFSC;
	Объект.Сухой1		 				= Объект.Сухой;
	Объект.Сертификат1 					= Объект.Сертификат;
	Объект.Характеристика1				= Объект.Характеристика;
	Объект.КоличествоСостав1			= Объект.КоличествоСостав;
	Объект.Габарит1						= Объект.Габарит; 
	Объект.Припуск1						= Объект.Припуск;
	Объект.КатегорияНоменклатурыПЭО1	= Объект.КатегорияНоменклатурыПЭО;
	Объект.СтруктурнаяЕдиница 			= СтруктурнаяЕдиница;
	Объект.СтруктурнаяЕдиница1 			= СтруктурнаяЕдиница;
	Объект.Ячейка 						= Ячейка;
	Объект.Ячейка1 						= Ячейка; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЯчейкуСушильногоПакета()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыВСушильныхКамерахОстатки.СерийныйНомер,
		|	алк_ПакетыВСушильныхКамерахОстатки.СушильнаяКамера,
		|	алк_ПакетыВСушильныхКамерахОстатки.КоличествоОстаток,
		|	алк_ПакетыВСушильныхКамерахОстатки.ОбъемОстаток
		|ИЗ
		|	РегистрНакопления.алк_ПакетыВСушильныхКамерах.Остатки(&ДатаОстатки, СерийныйНомер = &СерийныйНомер) КАК алк_ПакетыВСушильныхКамерахОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатки", Объект.Дата);
	Запрос.УстановитьПараметр("СерийныйНомер", Объект.СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат  Справочники.Ячейки.НайтиПоНаименованию("Сушильная камера " + ВыборкаДетальныеЗаписи.СушильнаяКамера);
	КонецЦикла;
	
	Возврат Справочники.Ячейки.ПустаяСсылка();	
	

КонецФункции // ПолучитьЯчейкуСушильногоПакета()
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	
		Объект.СертификатFSC1 = Объект.СертификатFSC;	
	
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере() 
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Характеристика1ПриИзменении(Элемент)
	
	Элементы.Объем1.ЦветФона = Новый Цвет(247, 0, 0); 	
	Сообщить("Изменена характеристика, проверьте верность заполнения объема!");
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	Элементы.Объем.ЦветФона = Новый Цвет(247, 0, 0); 	
	Сообщить("Изменена характеристика, проверьте верность заполнения объема!");

КонецПроцедуры

&НаКлиенте
Процедура КатегорияНоменклатурыПриИзменении(Элемент)
	УстановитьОтборХарактеристикиПоКатегорииНоменклатуры();
КонецПроцедуры


&НаСервере
Процедура ПересчитатьВесИОбъемНаСервере()
	
	Объемы = РфпСервер.ОбъемыПакета(Объект.Характеристика1, Объект.КоличествоСостав1, Объект.Дата, РфпСервер.ПолучитьПараметрыПрипуска(Объект.Припуск1));
	
	Объект.Объем1 = Объемы.Объем;
	Объект.ОбъемТаможня1 = Объемы.ОбъемТаможня;  
	
	ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Объект.Характеристика1);
	
	ТЗБоковая = РегистрыСведений.алк_БоковаяДоска.СрезПоследних(Объект.Дата, Новый Структура("Сечение", ПараметрыХ["Сечение"]));
	
	Если ТЗБоковая.Количество() <> 0 Тогда 			
		ЭтоБоковаяДоска = Истина;      			
	Иначе                             			
		ЭтоБоковаяДоска = Ложь;       			
	КонецЕсли; 	
	
	ОтборРегистра = Новый Структура("Номенклатура, Порода, Влажность, БоковаяДоска",	
		Объект.Характеристика1.Владелец, 
		ПараметрыХ["Порода"], 
		ПараметрыХ["Влажность"], 
		ЭтоБоковаяДоска); 
		
	ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Объект.Дата, ОтборРегистра);
	
	Плотность = 0;
	Тара = 0;
	
	Если ТЗПлотность.Количество() = 1 Тогда
		Плотность = ТЗПлотность[0].ПлотностьКгМ3;
		Тара = ТЗПлотность[0].ВесТарыКг;
	Иначе		
		Для каждого стрПлотность Из ТЗПлотность Цикл   // для пилет по характеристике
			Если стрПлотность.Характеристика = Объект.Характеристика1 Тогда
				Плотность = стрПлотность.ПлотностьКгМ3;
				Тара = стрПлотность.ВесТарыКг;			
			КонецЕсли;	
		КонецЦикла; 		
	КонецЕсли; 	
	
	Объект.ВесНеттоТаможня1 = окр(Объект.ОбъемТаможня1 * Плотность / 1000, 3); 	
	Объект.ВесБруттоТаможня1 = окр(Объект.ВесНеттоТаможня1 + Тара / 1000, 3);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВесИОбъем(Команда)
	ПересчитатьВесИОбъемНаСервере();
КонецПроцедуры
